# Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-J8wXuTH3K4SKrAQw

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.aws_lambda_api.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda_api.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230423025247581000000001]
module.aws_lambda_api.aws_lambda_function.default: Refreshing state... [id=customer-api-customer-api-staging]
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=edfc614b91aa2a91f66b53a85a54315efb08e245]
module.aws_lambda_api.aws_iam_role.default: Drift detected (update)
module.aws_lambda_api.aws_lambda_function.default: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aws_api_gateway.aws_apigatewayv2_api.default will be created
  + resource "aws_apigatewayv2_api" "default" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "customer-api-customer-api-staging"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all                     = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }

      + cors_configuration {
          + allow_credentials = false
          + allow_methods     = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 0
        }
    }

  # module.aws_api_gateway.aws_apigatewayv2_integration.default will be created
  + resource "aws_apigatewayv2_integration" "default" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.aws_api_gateway.aws_apigatewayv2_route.any will be created
  + resource "aws_apigatewayv2_route" "any" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.aws_api_gateway.aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all      = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.aws_api_gateway.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gw/customer-api-customer-api-staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
    }

  # module.aws_api_gateway.aws_lambda_permission.default will be created
  + resource "aws_lambda_permission" "default" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "customer-api-customer-api-staging"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/customer-api-customer-api-staging"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
    }

  # module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-customer-api-customer-api-staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-customer-api-customer-api-staging"
    }

  # module.aws_lambda.aws_lambda_function.default will be created
  + resource "aws_lambda_function" "default" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../../../../../shared/infrastructure/modules/lambda/lambda.zip"
      + function_name                  = "customer-api-customer-api-staging"
      + handler                        = "main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "BZXwJRdKzrdLUL+ctMV0G0ZCuecQRa0Q38EOd9QY5mo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + tags_all                       = {
          + "domain"        = "customer"
          + "environment"   = "customer-api-staging"
          + "resource"      = "customer-api"
          + "resource_type" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.aws_lambda_api.aws_iam_role.default will be destroyed
  # (because aws_iam_role.default is not in configuration)
  - resource "aws_iam_role" "default" {
      - arn                   = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-customer-api-staging" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-04-23T02:52:47Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-execution-customer-api-customer-api-staging" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-execution-customer-api-customer-api-staging" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "lambda"
          - "resource-type" = "api"
        } -> null
      - tags_all              = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "lambda"
          - "resource-type" = "api"
        } -> null
      - unique_id             = "AROAXPSHQYQCOIIBUPECV" -> null
    }

  # module.aws_lambda_api.aws_iam_role_policy_attachment.default will be destroyed
  # (because aws_iam_role_policy_attachment.default is not in configuration)
  - resource "aws_iam_role_policy_attachment" "default" {
      - id         = "lambda-execution-customer-api-customer-api-staging-20230423025247581000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "lambda-execution-customer-api-customer-api-staging" -> null
    }

  # module.aws_lambda_api.aws_lambda_function.default will be destroyed
  # (because aws_lambda_function.default is not in configuration)
  - resource "aws_lambda_function" "default" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging" -> null
      - filename                       = "../../../../../shared/infrastructure/modules/lambda/lambda.zip" -> null
      - function_name                  = "customer-api-customer-api-staging" -> null
      - handler                        = "main" -> null
      - id                             = "customer-api-customer-api-staging" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging/invocations" -> null
      - last_modified                  = "2023-04-23T02:52:56.414+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::514472330244:role/lambda-execution-customer-api-customer-api-staging" -> null
      - runtime                        = "go1.x" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "BZXwJRdKzrdLUL+ctMV0G0ZCuecQRa0Q38EOd9QY5mo=" -> null
      - source_code_size               = 18750761 -> null
      - tags                           = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "lambda"
          - "resource-type" = "api"
        } -> null
      - tags_all                       = {
          - "domain"        = "customer"
          - "environment"   = "customer-api-staging"
          - "resource"      = "lambda"
          - "resource-type" = "api"
        } -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

Plan: 10 to add, 0 to change, 3 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*